//Напишите программу, которая принимает радиус окружности и выводит на экран площадь круга, используется формула S=pi x r x r
public class Square {
    public static void main(String[] args) {
        float r = 10.8f;
        float pi = 3.14f;
        float s = pi * r * r;
        System.out.println("Площадь круга: " + s);
    }
}
